{
    "id": 1,
    "title": "大三之前",
    "summary": "用于记录过去3年,我都做了什么",
    "content": "## 大一时期\n\n​\t大一那年，我对一切都感到迷茫，不知道未来该学些什么。每天的生活几乎只在三件事之间轮回：上课、打游戏、吃饭。那时的我痴迷于网络游戏，尤其是《永劫无间》，它给我留下了深刻印象。与传统的FPS或MOBA游戏不同(现在的我是以学过不少游戏设计理念的角度来看的)，它提供了一种更加细致且独具特色的博弈体验。游戏中的每一次较量——赢了、输了、再赢了、再输了——都让我彻夜难眠，沉浸其中。\n\n​\t除了游戏，大一的课程安排异常繁多，但我对那些让我感觉毫无意义的课程提不起兴趣。对我来说，在课堂上主动吸收知识远不如自学来得有效。那么，我去上课究竟为了什么？是为了拿学分、为了顺利毕业、还是为了给老师一个面子？回想当时，我每节课都按时到场，如今回想起来，多少带着几分幼稚和盲目🫠。\n\n​\t总体来说，大一时的我处于极度迷茫的状态，但那时我从未去深究这些问题。不可否认的是，当时我的唯一目标就是将《永劫无间》打到最高段位，而我也成功达到了这个目标。可以说，我那时算是个小高手，这也让我感到无比满足和快乐😄。就这样，我的大一就这样在迷茫与激情中悄然流逝。\n\n## 大二时期\n\n​\t到了大二，我几乎没有什么改变，还是和以前一样，每天这样过着。直到某个时间节点(我也忘了是什么时候).我抑郁了，我越来越否定自己，某些失败貌似刺激了我，考试失败，被拒绝，身体状态越来越差，对自己迷茫的未来感到担忧......我还是忘了不了《永劫无间》，当时的我在现实生活中虽然四处碰壁，但是在游戏世界里我至少还是比大部分人都要强，只到某个想法在我的脑海里诞生。我不把重心放在排位赛上，而是挑战自己，只和高手过招，我不断地磨练自己的水平，在训练场里反复琢磨一个个招式和博弈技巧，让我在面对真正的高手(职业水平)时也可以临危不惧，有一力敌之......(* ￣︿￣)。直到我到达了某一个瓶颈，我才意识到自己并不是天才，而是一个努力的普通玩家,我被那些真正的高手虐得死去活来，我还在心里暗自安慰道只有和高手玩才会变强，只可惜玩具永远都是玩具🥲.我彻底破防了，我也意识到自己卷不动了，也该放下了。回到现实生活这边，我怎么看不到一点点未来的希望？emo了挺久之后，我开始做出了一点点微小的改变。\n\n#### 第一个改变：我开始旷课\n\n​\t旷课在大多数人眼中貌似是一种非常差劲的行为，我的内心也有过恐惧和挣扎，如果我旷课后被老师发现了，我会怎么样？如果我旷课后，我身边的人会怎么看待我？一连串的问题我都有好好思考过。最终我开始慢慢接受了旷课这个行为。哪怕这对其他人也好，学校也罢是一种不良影响，但是对我来说它是有价值的。我很累，那我为什么要去上课？如果我休息好了，我是不是就可以提高自学效率，如果我休息好了，我是不是可以做得更好.....\n也有一些时候我会旷课去自习。(现在看来我当初做出的选择是正确的，无论是考试还是专业水平我都在无数次旷课中得到了提升，还有我的生活也没有那么累)\n\n#### 第二个改变:坚持校园跑\n\n​\t因为心里压抑和宿舍休息环境的问题，我一直比较虚。体育和体测双双拉跨的情况屡次上演，自习看一会就累了，身体消瘦仿佛被榨干🥲。上个大学越上越虚，脆皮大学生这个词形容地就是我.....我的改变方式是开始锻炼恢复，长跑是我一直坚持的事情，在长期奔跑的过程的我的身体得到了明显的改善，并且我的想法越来越多，在锻炼时我总是会想各式各样的事情，这种深度的思考让我着迷......\n\n#### 第三个改变:勇敢的尝试\n\n​\t对比之前上课、打游戏、吃饭这老3样无限循环的生活而言，我一点都不满足，我开始尝试各式各样的新鲜事物\n\n​\t【研究游戏】和打游戏不同，我换了几个游戏玩，并且尝试用最好的方式去玩。【剪视频】我开始学习一些剪辑的技能，上传到网络上【加入xx社团】我报名了一些社团，虽然这个并没有给我带来什么正面的反馈，但是我依然认为它是一次次勇敢的尝试【自学编程】虽然我本来就是这个专业的，但是奈何计算机很难，大部分人都放弃了，或者摆烂了，我去尝试学习。还有许许多多的事情罗列不完【建模】【去图书馆自习】【制作游戏脚本】......\n\n## 大三时期-上\n\n​\t我开始感叹自己在过去做过的事情，哇我最终成功了的这种心态终于在我的心中绽放，我甚至对未来充满了希望。怀念过去，我玩过的游戏特别特别多，我尝试各式各样不同的游戏，看过游戏设计的书。在自习时光的空洞中被知识的顿悟给感化。一切都看上去井井有条，我也在稳扎稳打地进步，在成长。或许有时会感到一丝丝的寂寞和迷茫，但是相比于之前好太多。大三上学期我基本上在大二的改变下继续成长，唯一让我感到难受的一点是计算机还是太难了，我的知识在实际开发中就是一坨屎，我写过很多屎山代码。此时我想到了当初我在玩《永劫无间》时我遇到了一个瓶颈，然后我就退游了，学计算机难还是打游戏难，明明这两个都很难.....我只是一个普通的玩家，一个普通的学生。放弃......不为一种选择......但是这一次我不想放弃，\"打到最高段位\"这个感念貌似并没有被实现,成为一个靠谱的程序员是我当下的一次尝试，或许许多年以后我也也会放下这件事，彻底摆脱敲代码的生活.\n\n<未完待续!>"
}